Autodesk.Revit.Exceptions.InapplicableDataException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.InapplicableDataException
The exception that is thrown when attempting to access a piece of data that is structurally not part of an object at the moment.